[{
  "headline": "Solving the Procrastination Puzzle: A Concise Guide to Strategies for Change",
  "source_link": "https://www.goodreads.com/tr/book/show/18079767",
  "content": "Why do we sabotage our own best intentions? How can we eliminate procrastination from our lives for good? Based on current psychological research and supplemented with clear strategies for change, this concise guide will help readers finally break free from self-destructive ideas and habits, and move into freedom and accomplishment. ",
  "image_link":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1382356181i/18079767.jpg"
},
  {
    "headline": "Debunking the myths of procrastination: Does ‘positive procrastination’ exist?",
    "source_link": "https://www.euronews.com/next/2023/09/19/debunking-the-myths-of-procrastination-what-is-it-and-how-can-you-stop",
    "content": "This idea of positive procrastination was popularized by philosophy professor John Perry (a typical self-hating procrastinator himself), who wrote an essay in 1995 titled “Structured Procrastination,” where he talked about the use of procrastination as a tool to accomplish goals. He turned this idea into a book: “The Art of Procrastination.”\n\nIt all began when he recognized that, in contrast to how he had felt his entire life about procrastinating, he was typically very productive most of the time. He said: “Procrastinators seldom do nothing.”",
    "image_link":"https://www.liveabout.com/thmb/vlvyHRGn61KxC_AsyRR2t9eqLCQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/procrastinationmemes2-5c5853f5c9e77c000159a777.jpg"
  },
  {
    "headline": "Ted Talks are ridiculously pseudo intellectual garbage(?)",
    "source_link": "https://www.reddit.com/r/unpopularopinion/comments/6r9e49/ted_talks_are_ridiculously_pseudo_intellectual/",
    "content": "Have you ever felt that you get more done when you're not sitting at your desk? Perhaps you believe that you are interrupted more in the office, or that you don't have the proper work setup. In this talk by Jason Fried, you'll find out why we have this perception, if it is actually true, and what we can do about it.",
    "image_link":"https://i0.wp.com/startuphukuku.com/wp-content/uploads/2017/05/ted.jpg?fit=1600%2C885&ssl=1"
  },
  {
    "headline": "Procrastination Is Really Perfectionism",
    "source_link": "https://psychcentral.com/blog/procrastination-is-really-perfectionism#1",
    "content": "Once you’ve completed some easy attempts at being “imperfect,” move on to something bigger. If you have a presentation for work, allot a specific amount of reasonable time (far less than you normally would) to put together the content. You’ll be amazed at how much you can get done in that compressed amount of time.",
    "image_link":"https://pbs.twimg.com/media/B0oNKWYCYAEVf5W.png:large"
  },
  {
    "headline": "Procrastination Test",
    "source_link": "https://www.idrlabs.com/procrastination/test.php",
    "content": "Procrastination encompasses a range of behaviors centered around the phenomenon of postponing important activities until the last moment. Though studies indicate that procrastination is common and associated with poorer professional and academic performance, the disposition to procrastinate is often not taken seriously or merely shamed as being lazy.",
    "image_link":"https://www.idrlabs.com/static/i/logo-fb.jpg"
  }
]