[
  {
    "id": 101,
    "user_id": 1001,
    "ia_ids": [1],
    "source_link": "https://www.marca.com/en/football/2023/10/10/65251a10ca474153788b4578.html",
    "content": "The next World Cup may be three years away, but Cristiano Ronaldo reportedly plans to take part in the 2026 World Cup in the USA, Mexico and Canada.",
    "created_at": "2023-10-25 10:30:00"
  },
  {
    "id": 102,
    "user_id": 1001,
    "ia_ids": [2, 3],
    "source_link": "https://apnews.com/article/hip-hop-50th-anniversary-nba-hisrory-81d0ada460ac2744ac9bd5eda66b6779",
    "content": "Just as a movie soundtrack helps viewers follow the action of the narrative through each plot twist, hip-hop has done the same for basketball via the NBA. Over the past five decades, the genre has inserted lyrics, beats and culture into the sport’s DNA. Now, as hip-hop reaches its 50th anniversary, the two are intertwined like a colorful, crisscrossed ball of yarn.",
    "created_at": "2023-10-24 11:15:00"
  },
  {
    "id": 103,
    "user_id": 1001,
    "ia_ids": [4],
    "source_link": "https://pinchofyum.com/house-favorite-garlic-bread",
    "content": "We did a soup series a few years ago, and I was thisclose to posting a garlic bread recipe in the series, but I never quite locked it in. I just could never commit to a certain type of bread, or a particular texture, or just a general look and feel. Do we want it crusty? Chewy? Hearty? Or light and toasty?",
    "created_at": "2023-10-23 09:00:00"
  },
  {
    "id": 104,
    "user_id": 1001,
    "ia_ids": [5],
    "source_link": "https://www.nationalgeographic.com/premium/article/invisible-wonders-photography-techniques",
    "content": "As a kid, I dreamed of becoming a marine biologist and living my life by the sea. Since I grew up in a landlocked suburb of Atlanta, I lived out this fantasy by setting up aquariums at home. At 14, I started working at my neighborhood aquarium shop. By 16, I had seven fish tanks at home. Then, at 20, I was introduced to photographer David Liittschwager, who hired me to help him with a National Geographic magazine assignment on marine life.",
    "created_at": "2023-10-22 14:45:00"
  },
  {
    "id": 105,
    "user_id": 1001,
    "ia_ids": [1, 5],
    "source_link": "https://www.photocrowd.com/blog/195-beautiful-game-brief-guide-photographing-football-matches/",
    "content": "The temptation is to chase the action around the pitch. This will end up meaning you’re running as much as the players. It will benefit you to select one position, stay there and wait for the action to come to you. The prime position will be close to the net on one end of the pitch. This will give you opportunities to get great action shots as players fight for the ball and capture those crucial moments when a player scores.",
    "created_at": "2023-10-21 16:00:00"
  }
]
